import '../models/exercise_category.dart';

// لیست دسته‌بندی‌های تمرینات موجود
final List<ExerciseCategory> exerciseCategories = [
  ExerciseCategory('سینه',
      'پرس سینه,پرس بالا سینه,کراس اور,پرس زیر سینه,شنا سوئدی,فلای سینه دمبل,فلای سینه دستگاه,فلای کابل کراس اور,پرس سینه دمبل,پرس بالا سینه دمبل,پرس سینه هالتر,پول‌اور'),
  ExerciseCategory('پشت بازو',
      'پشت بازو هالتر,کیک بک,دیپ,پشت بازو دمبل تک دست,پشت بازو سیم کش,پشت بازو پارالل,پشت بازو دستگاه,پشت بازو طناب,پشت بازو کشش'),
  ExerciseCategory('زیر بغل',
      'لت دستگاه,بارفیکس,زیربغل هالتر,زیربغل دمبل خم,زیربغل دستگاه قایقی,زیربغل سیم کش,زیربغل تی بار,زیربغل کششی,دمبل تک خم'),
  ExerciseCategory('پا',
      'اسکوات,پرس پا,لانج,جلو پا دستگاه,پشت پا دستگاه,ساق پا دستگاه,لیفت مرده,هاک اسکوات,پلیومتریک,لانج پای عقبی,ددلیفت,پرس باسن,پرس باسن دمبل'),
  ExerciseCategory('سرشانه',
      'نشر از جانب,پرس سرشانه,فلای معکوس,نشر از جلو,پرس سرشانه دمبل,پرس سرشانه هالتر,نشر خم,پرس آرنولدی,کول هالتر,کول دمبل'),
  ExerciseCategory('فول بادی',
      'برپی,جامپ اسکوات,پوش آپ,شنا سوئدی,کراس فیت,پلانک,تمرین با کتل بل,تمرین با توپ پزشکی,تمرینات HIIT'),
  ExerciseCategory('هوازی',
      'دوچرخه,تردمیل,طناب زدن,دویدن,شنا,ایروبیک,پیاده روی سریع,الپتیکال,پله‌نوردی'),
  ExerciseCategory('ساعد',
      'پرس ساعد,پرس ساعد دمبل,پرس ساعد هالتر,پرس ساعد اسکات,پرس ساعد دمبل چکشی,کشش ساعد,جلو بازو ساعد'),
];
